/*Ã‹Ã Ã¡Ã  2, Ã·Ã Ã±Ã²Ã¼ 2, Ã¢Ã Ã°Ã¨Ã Ã­Ã² 2. 
Ã”Ã Ã¬Ã¨Ã«Ã¨Ã¿ Ãˆ.ÃŽ., Ã­Ã®Ã¬Ã¥Ã° Ã±Ã·Ã¥Ã²Ã , Ã±Ã³Ã¬Ã¬Ã  Ã­Ã  Ã±Ã·Ã¥Ã²Ã¥, Ã¤Ã Ã²Ã  Ã¯Ã®Ã±Ã«Ã¥Ã¤Ã­Ã¥Ã£Ã® Ã¨Ã§Ã¬Ã¥Ã­Ã¥Ã­Ã¨Ã¿.*/
/*
<<<<<<< HEAD
1 - ââîä ýëåìåíòîâ(ïîëåé) ñòðóêòóðû +
2 - âûâîä +
3 - «î÷èñòêà» ñòðóêòóðèðîâàííûõ ïåðåìåííûõ +
4 - ïîèñê ñâîáîäíîé ñòðóêòóðèðîâàííîé ïåðåìåííîé +
5 - ïîèñê â ìàññèâå ñòðóêòóðû è ìèíèìàëüíûì çíà÷åíèåì çàäàííîãî ïîëÿ
6 - ïîèñê â ìàññèâå ñòðóêòóð ýëåìåíòà ñ çàäàííûì çíà÷åíèåì ïîëÿ èëè ñ íàèáîëåå áëèçêèì ê íåìó ïî çíà÷åíèþ
7 - óäàëåíèå çàäàííîãî ýëåìåíòà
8 - èçìåíåíèå(ðåäàêòèðîâàíèå) çàäàííîãî ýëåìåíòà
9 - ñîðòèðîâêà ìàññèâà ñòðóêòóð â ïîðÿäêå âîçðàñòàíèÿ çàäàííîãî ïîëÿ
	(ïðè ñîðòèðîâêå ìîæíî èñïîëüçîâàòü òîò ôàêò, ÷òî â Ñè++ ðàçðåøàåòñÿ ïðèñâàèâàíèå ñòðóêòóðèðîâàííûõ ïåðåìåííûõ)
10 - âû÷èñëåíèå ñ ïðîâåðêîé è èñïîëüçîâàíèåì âñåõ ýëåìåíòîâ ìàññèâà ïî çàäàííîìó óñëîâèþ è ôîðìóëå
	(íàïðèìåð, îáùàÿ ñóììà íà âñåõ ñ÷åòàõ) - äàåòñÿ èíäèâèäóàëüíî 
=======
1 - Ã¢Ã¢Ã®Ã¤ Ã½Ã«Ã¥Ã¬Ã¥Ã­Ã²Ã®Ã¢(Ã¯Ã®Ã«Ã¥Ã©) Ã±Ã²Ã°Ã³ÃªÃ²Ã³Ã°Ã» +
2 - Ã¢Ã»Ã¢Ã®Ã¤ +
3 - Â«Ã®Ã·Ã¨Ã±Ã²ÃªÃ Â» Ã±Ã²Ã°Ã³ÃªÃ²Ã³Ã°Ã¨Ã°Ã®Ã¢Ã Ã­Ã­Ã»Ãµ Ã¯Ã¥Ã°Ã¥Ã¬Ã¥Ã­Ã­Ã»Ãµ +
4 - Ã¯Ã®Ã¨Ã±Ãª Ã±Ã¢Ã®Ã¡Ã®Ã¤Ã­Ã®Ã© Ã±Ã²Ã°Ã³ÃªÃ²Ã³Ã°Ã¨Ã°Ã®Ã¢Ã Ã­Ã­Ã®Ã© Ã¯Ã¥Ã°Ã¥Ã¬Ã¥Ã­Ã­Ã®Ã© +
5 - Ã¯Ã®Ã¨Ã±Ãª Ã¢ Ã¬Ã Ã±Ã±Ã¨Ã¢Ã¥ Ã±Ã²Ã°Ã³ÃªÃ²Ã³Ã°Ã» Ã¨ Ã¬Ã¨Ã­Ã¨Ã¬Ã Ã«Ã¼Ã­Ã»Ã¬ Ã§Ã­Ã Ã·Ã¥Ã­Ã¨Ã¥Ã¬ Ã§Ã Ã¤Ã Ã­Ã­Ã®Ã£Ã® Ã¯Ã®Ã«Ã¿
6 - Ã¯Ã®Ã¨Ã±Ãª Ã¢ Ã¬Ã Ã±Ã±Ã¨Ã¢Ã¥ Ã±Ã²Ã°Ã³ÃªÃ²Ã³Ã° Ã½Ã«Ã¥Ã¬Ã¥Ã­Ã²Ã  Ã± Ã§Ã Ã¤Ã Ã­Ã­Ã»Ã¬ Ã§Ã­Ã Ã·Ã¥Ã­Ã¨Ã¥Ã¬ Ã¯Ã®Ã«Ã¿ Ã¨Ã«Ã¨ Ã± Ã­Ã Ã¨Ã¡Ã®Ã«Ã¥Ã¥ Ã¡Ã«Ã¨Ã§ÃªÃ¨Ã¬ Ãª Ã­Ã¥Ã¬Ã³ Ã¯Ã® Ã§Ã­Ã Ã·Ã¥Ã­Ã¨Ã¾
7 - Ã³Ã¤Ã Ã«Ã¥Ã­Ã¨Ã¥ Ã§Ã Ã¤Ã Ã­Ã­Ã®Ã£Ã® Ã½Ã«Ã¥Ã¬Ã¥Ã­Ã²Ã 
8 - Ã¨Ã§Ã¬Ã¥Ã­Ã¥Ã­Ã¨Ã¥(Ã°Ã¥Ã¤Ã ÃªÃ²Ã¨Ã°Ã®Ã¢Ã Ã­Ã¨Ã¥) Ã§Ã Ã¤Ã Ã­Ã­Ã®Ã£Ã® Ã½Ã«Ã¥Ã¬Ã¥Ã­Ã²Ã 
9 - Ã±Ã®Ã°Ã²Ã¨Ã°Ã®Ã¢ÃªÃ  Ã¬Ã Ã±Ã±Ã¨Ã¢Ã  Ã±Ã²Ã°Ã³ÃªÃ²Ã³Ã° Ã¢ Ã¯Ã®Ã°Ã¿Ã¤ÃªÃ¥ Ã¢Ã®Ã§Ã°Ã Ã±Ã²Ã Ã­Ã¨Ã¿ Ã§Ã Ã¤Ã Ã­Ã­Ã®Ã£Ã® Ã¯Ã®Ã«Ã¿
	(Ã¯Ã°Ã¨ Ã±Ã®Ã°Ã²Ã¨Ã°Ã®Ã¢ÃªÃ¥ Ã¬Ã®Ã¦Ã­Ã® Ã¨Ã±Ã¯Ã®Ã«Ã¼Ã§Ã®Ã¢Ã Ã²Ã¼ Ã²Ã®Ã² Ã´Ã ÃªÃ², Ã·Ã²Ã® Ã¢ Ã‘Ã¨++ Ã°Ã Ã§Ã°Ã¥Ã¸Ã Ã¥Ã²Ã±Ã¿ Ã¯Ã°Ã¨Ã±Ã¢Ã Ã¨Ã¢Ã Ã­Ã¨Ã¥ Ã±Ã²Ã°Ã³ÃªÃ²Ã³Ã°Ã¨Ã°Ã®Ã¢Ã Ã­Ã­Ã»Ãµ Ã¯Ã¥Ã°Ã¥Ã¬Ã¥Ã­Ã­Ã»Ãµ)
10 - Ã¢Ã»Ã·Ã¨Ã±Ã«Ã¥Ã­Ã¨Ã¥ Ã± Ã¯Ã°Ã®Ã¢Ã¥Ã°ÃªÃ®Ã© Ã¨ Ã¨Ã±Ã¯Ã®Ã«Ã¼Ã§Ã®Ã¢Ã Ã­Ã¨Ã¥Ã¬ Ã¢Ã±Ã¥Ãµ Ã½Ã«Ã¥Ã¬Ã¥Ã­Ã²Ã®Ã¢ Ã¬Ã Ã±Ã±Ã¨Ã¢Ã  Ã¯Ã® Ã§Ã Ã¤Ã Ã­Ã­Ã®Ã¬Ã³ Ã³Ã±Ã«Ã®Ã¢Ã¨Ã¾ Ã¨ Ã´Ã®Ã°Ã¬Ã³Ã«Ã¥
	(Ã­Ã Ã¯Ã°Ã¨Ã¬Ã¥Ã°, Ã®Ã¡Ã¹Ã Ã¿ Ã±Ã³Ã¬Ã¬Ã  Ã­Ã  Ã¢Ã±Ã¥Ãµ Ã±Ã·Ã¥Ã²Ã Ãµ) - Ã¤Ã Ã¥Ã²Ã±Ã¿ Ã¨Ã­Ã¤Ã¨Ã¢Ã¨Ã¤Ã³Ã Ã«Ã¼Ã­Ã® 
>>>>>>> 69b97f40e709899dfa52f5e3e4cb6eae96c16169
*/

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <malloc.h>
<<<<<<< HEAD
#include <windows.h>
#include <ctime>
=======
>>>>>>> 69b97f40e709899dfa52f5e3e4cb6eae96c16169

typedef struct
{
	int test;
	
} Account;

void fillAcc(Account *accounts, int arrSize)
{
	for (int i = 0; i < arrSize; i++)
		(accounts + i)->test = 1+rand()%100;
}

void printArrayTest(Account *accounts, int arrSize)
{
	for (int i = 0; i < arrSize; i++)
		printf("%d ", (accounts + i)->test);
	printf("\n\n");
}

void scanAcc(Account *accounts, int id)
{
	printf("please type a number:\n");
	scanf("%d", &(accounts + id)->test);
}

void printAcc(Account *accounts, int id)
{
	if ((accounts + id)->test != 0)
		printf("%d \n", (accounts + id)->test);
	else
		printf("account with this id doesent exist\n");
}

void clearingAcc(Account *accounts, int id, int arrSize)
{
	if (id < arrSize)
		(accounts + id)->test = 0;
}

void searchFreePlace(Account *accounts, int arrSize, int *acc)
{
	int i;
	for (i = 0; i < arrSize && (accounts + i)->test != 0; i++); 
	if ((accounts + i)->test == 0)
		(accounts + i)->test = *acc;
	else
		printf("there is no free places\n");
	
}

void main()
{
	int arrSize = 20;
	int id = 0;
	int acc = 1999;
	Account *accounts = (Account *)malloc(arrSize * sizeof(Account));

	printf("enter id: \n");
	scanf("%d", &id);

	fillAcc(accounts, arrSize);
	printArrayTest(accounts, arrSize);
	searchFreePlace(accounts, arrSize, &acc);
	printArrayTest(accounts, arrSize);

	free(accounts);
}